<a href="https://colab.research.google.com/github/shahzadokara/python_exercise/blob/master/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
a = pd.Series(data=[2,3,4], index=["ali", "Jhon", "shahzad"])
print(a)
print()
a.index
print()

ali        2
Jhon       3
shahzad    4
dtype: int64

In [55]:
import pandas as pd

d = {"First" : pd.Series([12,23,34,45,5,6,67], index=["Chair", "Table", "Computer", "Book", "Monitor", "Home", "Jaguar"]),
     "Second": pd.Series([23,45,34,23], index=["Table", "Tree", "Home", "Chair"]),
     "Third" : pd.Series([23,45,12,34,32,12], index=["Book", "Chair", "Jaguar", "Name", "Okara", "Pakistan"])}
df= pd.DataFrame(d)
df

          First  Second  Third
Book       45.0     NaN   23.0
Chair      12.0    23.0   45.0
Computer   34.0     NaN    NaN
Home        6.0    34.0    NaN
Jaguar     67.0     NaN   12.0
Monitor     5.0     NaN    NaN
Name        NaN     NaN   34.0
Okara       NaN     NaN   32.0
Pakistan    NaN     NaN   12.0
Table      23.0    23.0    NaN
Tree        NaN    45.0    NaN